Revit 2027 API
ParameterTypeId.MepElecZoneEquipmentType Property
 "Equipment Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId MepElecZoneEquipmentType { get; }
Public Shared ReadOnly Property MepElecZoneEquipmentType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ MepElecZoneEquipmentType {
	ForgeTypeId^ get ();
}
static member MepElecZoneEquipmentType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace